
#### 4. 创建 YAML 文件（复制到 `ultralytics/cfg/models/v11/sfg-yolov11.yaml`）

```yaml
# SFG-YOLOv11 Model
# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=sfg-yolov11n.yaml' will call sfg-yolov11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# SFG-YOLOv11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, IFEM, [512]]              # 5

  - [-1, 1, Conv, [512, 3, 2]]     # 6-P4/16
  - [-1, 2, C3k2, [512, True]]     # 7
  - [-1, 1, IFEM, [512]]              # 8

  - [-1, 1, Conv, [1024, 3, 2]]    # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]    # 10
  - [-1, 1, SPPF, [1024, 5]]         # 11
  - [-1, 2, C2PSA, [1024]]           # 12


# SFG-YOLOv11 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, AFM_Concat2, [1]]  # 14

  - [-1, 2, C3k2, [512, False]]    # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, AFM_Concat2, [1]]  # 17

  - [-1, 2, C3k2, [256, False]]    # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, AFM_Concat2, [1]] # 20

  - [-1, 2, C3k2, [512, False]]    # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, AFM_Concat2, [1]] # 23

  - [-1, 2, C3k2, [1024, True]]    # 24 (P5/32-large)

  - [18, 1, GACM, []]                 # 25
  - [21, 1, GACM, []]                 # 26
  - [24, 1, GACM, []]                 # 27

  - [[25, 26, 27], 1, Detect, [nc]]   # Detect(P3, P4, P5)